## DBMS Using SQL

In [1]:
# istalling the libraries
# !pip install mysql
# !pip install --upgrade mysql-connector-python
# !pip install python-dotenv
import mysql
import os
from dotenv import load_dotenv

In [2]:
import pip 
print(pip.__version__)

24.0

In [3]:
load_dotenv()
host = os.getenv('host_n')
password = os.getenv('password')
user = os.getenv('user')

In [4]:
import mysql.connector
from mysql.connector import Error 
import pandas as pd

In [5]:
def create_server_and_database_connection(host_n, user_n, password, db_name):
    connection = None
    try:
        connection = mysql.connector.connect(host=host_n, user=user_n, passwd=password)#creating server connection
        cursor = connection.cursor()
        cursor.execute('USE {}'.format(db_name))#creating database connection
    except Error as err:
        print('Error:', err)
    return connection

In [6]:
def execute_query(query):
    connection = create_server_and_database_connection(host, user, password, 'mysql_python') 
    try:
        cursor = connection.cursor()
        cursor.execute(query)
        connection.commit()
        print('Query executed successfully')
    except Error as err:
        print('Error:', err)

In [7]:
def return_result(query, multi=True):
    result = None
    connection = create_server_and_database_connection(host, user, password, 'mysql_python') 
    try:
        cursor = connection.cursor()
        cursor.execute(query)
        result = cursor.fetchall()
        return result
    except Error as err:
        print('Error:', err)

## Viewing all databases

In [8]:
return_result('show databases;')# show databases/tables

[('information_schema',),
 ('mysql',),
 ('mysql_python',),
 ('performance_schema',),
 ('sys',)]

## Viewing all tables

In [8]:
return_result('show tables;')

[('emp2',),
 ('employee',),
 ('employee_details',),
 ('employee_work',),
 ('entries',),
 ('position_',),
 ('records',),
 ('work_details',)]

## Dropping/Deleting a Table

In [9]:
execute_query( 'drop table if exists employee_work;')

Query executed successfully

## Creating a Table using constraints

### Constraints in Sql
1) <b>Not null</b> - Ensures column cannot have any null values<br>
2) <b>unique</b> - Ensures all values in a column are different.<br>
3) <b>primary key</b> - a combination of <b>Not null</b> and <b>unique</b> . Uniquely identifies each row in a table;<br>
4) <b>foreign key</b> - Precents actions that would create links between tables(primary key for other tables of merging is also not null-unique combination)<br>
5) <b>check</b> - Ensures that the values in a colummn satisfies a specific condition<br>
6) <b>default</b> - Sets a default value for a column if no value is specified<br>
7) <b>create index</b> - Used to create an index on one or more columns of a database table to improve the retrieval speed of data.<br>

### Datatypes in Sql (Important)
1) <b>int</b> - contains integers (not fractional)<br>
2) <b>float</b>- contains fractional numbers<br>
3) <b>varchar</b> - a string (can contains  0 to 65535 characters)<br>
4) <b>char</b>- a string (can contain 1 to 255 characters only)<br>
5) <b>date</b>- a date format(YYYY-MM-DD)<br>
6) <b>year</b>- a year in four digit format<br>

In [10]:
execute_query( 'drop table if exists employee_details;')

tab1 = '''create table employee_details(
EmployeeId int primary key not null auto_increment, 
Name varchar(20),
D_O_J date unique ,
Age int,
Gender char(4) ,
Department varchar(20),
Experience float,
Salary float,
City varchar(20));'''

execute_query( tab1)

Query executed successfully
Query executed successfully

In [11]:
return_result( 'show tables;')

[('emp2',),
 ('employee',),
 ('employee_details',),
 ('entries',),
 ('position_',),
 ('records',),
 ('work_details',)]

## Inserting records into fields of a table

In [12]:
insert_tab1 = '''insert into employee_details(Name, D_O_J,  Age, Gender, Department, Experience, Salary, City)
values('Anthony Rodrigues','2006-02-08','17','M','AI','8','200000','BOSTON'),
('Mark Rodrigues','2004-01-26','19','M','CS','8','179000','BOSTON'),
('Leslie Rodrigues','2004-08-29','21','M','CS','7','170000','BOSTON'),
('Caleb Rodrigues','2013-12-28','10','M','CS','3','130000','OHIO'),
('Valencio Rodrigues','2001-04-12','22','M','B','5','205000','BOSTON'),
('Vanessa Rodrigues','2000-01-27','23','F','FD','4','120000','WASHINGTON'),
('Sharon Mascarenhas','2004-08-03','19','F','CS','4','132000','VEGAS'),
('Steven Mascarenhas','2008-07-26','15','M','CS','2','114000','OHIO'),
('Llyod Mascarenhas','2020-11-27','3','M','CS','2','75000','WASHINGTON'),
('Roshaun Rodrigues','2003-08-19','20','M','IT','3','159000','VEGAS'),
('Russel Ambatti','2006-06-07','17','M','IT','1','62000','OHIO');'''

execute_query( insert_tab1)

Query executed successfully

## Displaying the data 
select statement

In [13]:
res = return_result( 'select * from employee_details')
for i in res:
    print(i)

(1, 'Anthony Rodrigues', datetime.date(2006, 2, 8), 17, 'M', 'AI', 8.0, 200000.0, 'BOSTON')
(2, 'Mark Rodrigues', datetime.date(2004, 1, 26), 19, 'M', 'CS', 8.0, 179000.0, 'BOSTON')
(3, 'Leslie Rodrigues', datetime.date(2004, 8, 29), 21, 'M', 'CS', 7.0, 170000.0, 'BOSTON')
(4, 'Caleb Rodrigues', datetime.date(2013, 12, 28), 10, 'M', 'CS', 3.0, 130000.0, 'OHIO')
(5, 'Valencio Rodrigues', datetime.date(2001, 4, 12), 22, 'M', 'B', 5.0, 205000.0, 'BOSTON')
(6, 'Vanessa Rodrigues', datetime.date(2000, 1, 27), 23, 'F', 'FD', 4.0, 120000.0, 'WASHINGTON')
(7, 'Sharon Mascarenhas', datetime.date(2004, 8, 3), 19, 'F', 'CS', 4.0, 132000.0, 'VEGAS')
(8, 'Steven Mascarenhas', datetime.date(2008, 7, 26), 15, 'M', 'CS', 2.0, 114000.0, 'OHIO')
(9, 'Llyod Mascarenhas', datetime.date(2020, 11, 27), 3, 'M', 'CS', 2.0, 75000.0, 'WASHINGTON')
(10, 'Roshaun Rodrigues', datetime.date(2003, 8, 19), 20, 'M', 'IT', 3.0, 159000.0, 'VEGAS')
(11, 'Russel Ambatti', datetime.date(2006, 6, 7), 17, 'M', 'IT', 1.0, 62000.0, 'OHIO')

In [14]:
from_table = []
for i in res:
    i = list(i)
    from_table.append(i)
cols = ['EmployeeId' ,'Name' ,'D_O_J' ,'Age' ,'Gender' ,'Department' ,'Experience' ,'Salary' ,'City']
df = pd.DataFrame(from_table, columns=cols)
df

,EmployeeId,Name,D_O_J,Age,Gender,Department,Experience,Salary,City
0,1,Anthony Rodrigues,2006-02-08,17,M,AI,8.0,200000.0,BOSTON
1,2,Mark Rodrigues,2004-01-26,19,M,CS,8.0,179000.0,BOSTON
2,3,Leslie Rodrigues,2004-08-29,21,M,CS,7.0,170000.0,BOSTON
3,4,Caleb Rodrigues,2013-12-28,10,M,CS,3.0,130000.0,OHIO
4,5,Valencio Rodrigues,2001-04-12,22,M,B,5.0,205000.0,BOSTON
5,6,Vanessa Rodrigues,2000-01-27,23,F,FD,4.0,120000.0,WASHINGTON
6,7,Sharon Mascarenhas,2004-08-03,19,F,CS,4.0,132000.0,VEGAS
7,8,Steven Mascarenhas,2008-07-26,15,M,CS,2.0,114000.0,OHIO
8,9,Llyod Mascarenhas,2020-11-27,3,M,CS,2.0,75000.0,WASHINGTON
9,10,Roshaun Rodrigues,2003-08-19,20,M,IT,3.0,159000.0,VEGAS
10,11,Russel Ambatti,2006-06-07,17,M,IT,1.0,62000.0,OHIO

### Describe Table

In [15]:
return_result( 'describe employee_details')

[('EmployeeId', 'int', 'NO', 'PRI', None, 'auto_increment'),
 ('Name', 'varchar(20)', 'YES', '', None, ''),
 ('D_O_J', 'date', 'YES', 'UNI', None, ''),
 ('Age', 'int', 'YES', '', None, ''),
 ('Gender', 'char(4)', 'YES', '', None, ''),
 ('Department', 'varchar(20)', 'YES', '', None, ''),
 ('Experience', 'float', 'YES', '', None, ''),
 ('Salary', 'float', 'YES', '', None, ''),
 ('City', 'varchar(20)', 'YES', '', None, '')]

In [16]:
insert2_tab1 = '''insert into employee_details (Name,D_O_J,Age,Gender,Department,Experience,Salary,City) #cols to insert into 
values('Salu Bhai','1999-06-25','53','M','IT', 7, '57000', 'SEATTLE'), #rows to insert 
('P town', '2009-06-10', '24', 'M', 'AI', 5,  '170000', 'VEGAS'),
('Rajesh', '2013-09-18', '29', 'F', 'B', 8, '84000', 'SEATTLE'),
('Bimles', '2006-09-18', '59', 'F','FD',6, '58662.25', 'WASHINGTON');'''

execute_query( insert2_tab1)

Query executed successfully

<font face=gabriola>

# Aggregate Functions
    
</font>
1)distinct<br>
2)avg<br>
3)count<br>
4)round<br>
5)length<br>
6)concat<br>
7)repeat<br>
8)ltrim/rtrim/trim<br>
9)upper/lower<br>
10)curdate<br>
11)sum <br>
12)reverse <br>
13)substr/substring

In [17]:
return_result( 'select distinct(Department) from employee_details')

[('AI',), ('CS',), ('B',), ('FD',), ('IT',)]

In [18]:
return_result( 'select avg(Salary) from employee_details')

[(127710.81666666667,)]

In [19]:
return_result( 'select count(Name) from employee_details')

[(15,)]

In [20]:
return_result( 'select Department, Experience,City, length(round(Salary)) as Sal_fig from employee_details')

[('AI', 8.0, 'BOSTON', 6),
 ('CS', 8.0, 'BOSTON', 6),
 ('CS', 7.0, 'BOSTON', 6),
 ('CS', 3.0, 'OHIO', 6),
 ('B', 5.0, 'BOSTON', 6),
 ('FD', 4.0, 'WASHINGTON', 6),
 ('CS', 4.0, 'VEGAS', 6),
 ('CS', 2.0, 'OHIO', 6),
 ('CS', 2.0, 'WASHINGTON', 5),
 ('IT', 3.0, 'VEGAS', 6),
 ('IT', 1.0, 'OHIO', 5),
 ('IT', 7.0, 'SEATTLE', 5),
 ('AI', 5.0, 'VEGAS', 6),
 ('B', 8.0, 'SEATTLE', 5),
 ('FD', 6.0, 'WASHINGTON', 5)]

In [21]:
return_result( 'select concat("Mr. ",Name, " has joined the company on ", D_O_J," is a ",Age, " year old ", Gender," Working in the ", Department," Field with ",Experience," years of experience from the ", City," office.") as Bio from employee_details')

[('Mr. Anthony Rodrigues has joined the company on 2006-02-08 is a 17 year old M Working in the AI Field with 8 years of experience from the BOSTON office.',),
 ('Mr. Mark Rodrigues has joined the company on 2004-01-26 is a 19 year old M Working in the CS Field with 8 years of experience from the BOSTON office.',),
 ('Mr. Leslie Rodrigues has joined the company on 2004-08-29 is a 21 year old M Working in the CS Field with 7 years of experience from the BOSTON office.',),
 ('Mr. Caleb Rodrigues has joined the company on 2013-12-28 is a 10 year old M Working in the CS Field with 3 years of experience from the OHIO office.',),
 ('Mr. Valencio Rodrigues has joined the company on 2001-04-12 is a 22 year old M Working in the B Field with 5 years of experience from the BOSTON office.',),
 ('Mr. Vanessa Rodrigues has joined the company on 2000-01-27 is a 23 year old F Working in the FD Field with 4 years of experience from the WASHINGTON office.',),
 ('Mr. Sharon Mascarenhas has joined the company on 2004-08-03 is a 19 year old F Working in the CS Field with 4 years of experience from the VEGAS office.',),
 ('Mr. Steven Mascarenhas has joined the company on 2008-07-26 is a 15 year old M Working in the CS Field with 2 years of experience from the OHIO office.',),
 ('Mr. Llyod Mascarenhas has joined the company on 2020-11-27 is a 3 year old M Working in the CS Field with 2 years of experience from the WASHINGTON office.',),
 ('Mr. Roshaun Rodrigues has joined the company on 2003-08-19 is a 20 year old M Working in the IT Field with 3 years of experience from the VEGAS office.',),
 ('Mr. Russel Ambatti has joined the company on 2006-06-07 is a 17 year old M Working in the IT Field with 1 years of experience from the OHIO office.',),
 ('Mr. Salu Bhai has joined the company on 1999-06-25 is a 53 year old M Working in the IT Field with 7 years of experience from the SEATTLE office.',),
 ('Mr. P town has joined the company on 2009-06-10 is a 24 year old M Working in the AI Field with 5 years of experience from the VEGAS office.',),
 ('Mr. Rajesh has joined the company on 2013-09-18 is a 29 year old F Working in the B Field with 8 years of experience from the SEATTLE office.',),
 ('Mr. Bimles has joined the company on 2006-09-18 is a 59 year old F Working in the FD Field with 6 years of experience from the WASHINGTON office.',)]

In [22]:
return_result( 'select repeat("@ ", 10)')

[('@ @ @ @ @ @ @ @ @ @ ',)]

In [23]:
return_result( 'select length(ltrim("     Hi     "))')#trims blank spaces from left

[(7,)]

In [24]:
return_result( 'select length(rtrim("     Hi     "))')#trims blank spaces from right

[(7,)]

In [25]:
return_result( 'select length(trim("     Hi      "))')#trims blank spaces from both sides

[(2,)]

In [26]:
return_result( 'select upper(Name)from employee_details')

[('ANTHONY RODRIGUES',),
 ('MARK RODRIGUES',),
 ('LESLIE RODRIGUES',),
 ('CALEB RODRIGUES',),
 ('VALENCIO RODRIGUES',),
 ('VANESSA RODRIGUES',),
 ('SHARON MASCARENHAS',),
 ('STEVEN MASCARENHAS',),
 ('LLYOD MASCARENHAS',),
 ('ROSHAUN RODRIGUES',),
 ('RUSSEL AMBATTI',),
 ('SALU BHAI',),
 ('P TOWN',),
 ('RAJESH',),
 ('BIMLES',)]

In [27]:
return_result( 'select lower(City)from employee_details')

[('boston',),
 ('boston',),
 ('boston',),
 ('ohio',),
 ('boston',),
 ('washington',),
 ('vegas',),
 ('ohio',),
 ('washington',),
 ('vegas',),
 ('ohio',),
 ('seattle',),
 ('vegas',),
 ('seattle',),
 ('washington',)]

In [28]:
return_result( 'select curdate()')

[(datetime.date(2023, 8, 2),)]

In [29]:
return_result( 'select sum(Salary) from employee_details')

[(1915662.25,)]

In [30]:
return_result( 'select reverse("desrever")')

[('reversed',)]

In [31]:
return_result( 'select substr("substring", 4, 4)')

[('stri',)]

In [32]:
return_result('select (100-90)  ,(5+5) , (5*2), round((900/90))')

[(10, 10, 10, Decimal('10'))]

In [33]:
return_result('select insert("characters", 4, 3, "hi")')

[('chahiters',)]

### Where clause
condition based

In [34]:
res = return_result('select *,character_length(City) from employee_details where character_length(City) > 6')
for i in res:
    print(i)

(6, 'Vanessa Rodrigues', datetime.date(2000, 1, 27), 23, 'F', 'FD', 4.0, 120000.0, 'WASHINGTON', 10)
(9, 'Llyod Mascarenhas', datetime.date(2020, 11, 27), 3, 'M', 'CS', 2.0, 75000.0, 'WASHINGTON', 10)
(12, 'Salu Bhai', datetime.date(1999, 6, 25), 53, 'M', 'IT', 7.0, 57000.0, 'SEATTLE', 7)
(14, 'Rajesh', datetime.date(2013, 9, 18), 29, 'F', 'B', 8.0, 84000.0, 'SEATTLE', 7)
(15, 'Bimles', datetime.date(2006, 9, 18), 59, 'F', 'FD', 6.0, 58662.2, 'WASHINGTON', 10)

In [35]:
res = return_result( 'select * from employee_details where length(round(Salary)) > 5')
for i in res:
    print(i)

(1, 'Anthony Rodrigues', datetime.date(2006, 2, 8), 17, 'M', 'AI', 8.0, 200000.0, 'BOSTON')
(2, 'Mark Rodrigues', datetime.date(2004, 1, 26), 19, 'M', 'CS', 8.0, 179000.0, 'BOSTON')
(3, 'Leslie Rodrigues', datetime.date(2004, 8, 29), 21, 'M', 'CS', 7.0, 170000.0, 'BOSTON')
(4, 'Caleb Rodrigues', datetime.date(2013, 12, 28), 10, 'M', 'CS', 3.0, 130000.0, 'OHIO')
(5, 'Valencio Rodrigues', datetime.date(2001, 4, 12), 22, 'M', 'B', 5.0, 205000.0, 'BOSTON')
(6, 'Vanessa Rodrigues', datetime.date(2000, 1, 27), 23, 'F', 'FD', 4.0, 120000.0, 'WASHINGTON')
(7, 'Sharon Mascarenhas', datetime.date(2004, 8, 3), 19, 'F', 'CS', 4.0, 132000.0, 'VEGAS')
(8, 'Steven Mascarenhas', datetime.date(2008, 7, 26), 15, 'M', 'CS', 2.0, 114000.0, 'OHIO')
(10, 'Roshaun Rodrigues', datetime.date(2003, 8, 19), 20, 'M', 'IT', 3.0, 159000.0, 'VEGAS')
(13, 'P town', datetime.date(2009, 6, 10), 24, 'M', 'AI', 5.0, 170000.0, 'VEGAS')

### and operator 
multi conditional

In [36]:
res = return_result( 'select * from employee_details where City in ("OHIO", "VEGAS") and Experience > 2')
for i in res:
    print(i)

(4, 'Caleb Rodrigues', datetime.date(2013, 12, 28), 10, 'M', 'CS', 3.0, 130000.0, 'OHIO')
(7, 'Sharon Mascarenhas', datetime.date(2004, 8, 3), 19, 'F', 'CS', 4.0, 132000.0, 'VEGAS')
(10, 'Roshaun Rodrigues', datetime.date(2003, 8, 19), 20, 'M', 'IT', 3.0, 159000.0, 'VEGAS')
(13, 'P town', datetime.date(2009, 6, 10), 24, 'M', 'AI', 5.0, 170000.0, 'VEGAS')

In [37]:
res = return_result( 'select * from employee_details where D_O_J between "2001-01-01" and "2010-12-31"')
for i in res:
    print(i)

(5, 'Valencio Rodrigues', datetime.date(2001, 4, 12), 22, 'M', 'B', 5.0, 205000.0, 'BOSTON')
(10, 'Roshaun Rodrigues', datetime.date(2003, 8, 19), 20, 'M', 'IT', 3.0, 159000.0, 'VEGAS')
(2, 'Mark Rodrigues', datetime.date(2004, 1, 26), 19, 'M', 'CS', 8.0, 179000.0, 'BOSTON')
(7, 'Sharon Mascarenhas', datetime.date(2004, 8, 3), 19, 'F', 'CS', 4.0, 132000.0, 'VEGAS')
(3, 'Leslie Rodrigues', datetime.date(2004, 8, 29), 21, 'M', 'CS', 7.0, 170000.0, 'BOSTON')
(1, 'Anthony Rodrigues', datetime.date(2006, 2, 8), 17, 'M', 'AI', 8.0, 200000.0, 'BOSTON')
(11, 'Russel Ambatti', datetime.date(2006, 6, 7), 17, 'M', 'IT', 1.0, 62000.0, 'OHIO')
(15, 'Bimles', datetime.date(2006, 9, 18), 59, 'F', 'FD', 6.0, 58662.2, 'WASHINGTON')
(8, 'Steven Mascarenhas', datetime.date(2008, 7, 26), 15, 'M', 'CS', 2.0, 114000.0, 'OHIO')
(13, 'P town', datetime.date(2009, 6, 10), 24, 'M', 'AI', 5.0, 170000.0, 'VEGAS')

### or operator 
multi conditional

In [38]:
res = return_result( 'select * from employee_details where City ="OHIO" or Salary < 75000')
for i in res :
    print(i)

(4, 'Caleb Rodrigues', datetime.date(2013, 12, 28), 10, 'M', 'CS', 3.0, 130000.0, 'OHIO')
(8, 'Steven Mascarenhas', datetime.date(2008, 7, 26), 15, 'M', 'CS', 2.0, 114000.0, 'OHIO')
(11, 'Russel Ambatti', datetime.date(2006, 6, 7), 17, 'M', 'IT', 1.0, 62000.0, 'OHIO')
(12, 'Salu Bhai', datetime.date(1999, 6, 25), 53, 'M', 'IT', 7.0, 57000.0, 'SEATTLE')
(15, 'Bimles', datetime.date(2006, 9, 18), 59, 'F', 'FD', 6.0, 58662.2, 'WASHINGTON')

### not operator

In [39]:
res = return_result('select * from employee_details where not City = "OHIO" and not Salary < 75000')
for i in res :
    print(i)

(1, 'Anthony Rodrigues', datetime.date(2006, 2, 8), 17, 'M', 'AI', 8.0, 200000.0, 'BOSTON')
(2, 'Mark Rodrigues', datetime.date(2004, 1, 26), 19, 'M', 'CS', 8.0, 179000.0, 'BOSTON')
(3, 'Leslie Rodrigues', datetime.date(2004, 8, 29), 21, 'M', 'CS', 7.0, 170000.0, 'BOSTON')
(5, 'Valencio Rodrigues', datetime.date(2001, 4, 12), 22, 'M', 'B', 5.0, 205000.0, 'BOSTON')
(6, 'Vanessa Rodrigues', datetime.date(2000, 1, 27), 23, 'F', 'FD', 4.0, 120000.0, 'WASHINGTON')
(7, 'Sharon Mascarenhas', datetime.date(2004, 8, 3), 19, 'F', 'CS', 4.0, 132000.0, 'VEGAS')
(9, 'Llyod Mascarenhas', datetime.date(2020, 11, 27), 3, 'M', 'CS', 2.0, 75000.0, 'WASHINGTON')
(10, 'Roshaun Rodrigues', datetime.date(2003, 8, 19), 20, 'M', 'IT', 3.0, 159000.0, 'VEGAS')
(13, 'P town', datetime.date(2009, 6, 10), 24, 'M', 'AI', 5.0, 170000.0, 'VEGAS')
(14, 'Rajesh', datetime.date(2013, 9, 18), 29, 'F', 'B', 8.0, 84000.0, 'SEATTLE')

### like operator
wild card character -  1)% - represents 0,1 or more characters<br> 
                       2)_ - represents a single character

In [40]:
res = return_result('select * from employee_details where D_O_J like "%-08-%"')
for i in res :
    print(i)

(3, 'Leslie Rodrigues', datetime.date(2004, 8, 29), 21, 'M', 'CS', 7.0, 170000.0, 'BOSTON')
(7, 'Sharon Mascarenhas', datetime.date(2004, 8, 3), 19, 'F', 'CS', 4.0, 132000.0, 'VEGAS')
(10, 'Roshaun Rodrigues', datetime.date(2003, 8, 19), 20, 'M', 'IT', 3.0, 159000.0, 'VEGAS')

In [41]:
res = return_result('select * from employee_details where Name like "%Rodrigues"')
for i in res :
    print(i)

(1, 'Anthony Rodrigues', datetime.date(2006, 2, 8), 17, 'M', 'AI', 8.0, 200000.0, 'BOSTON')
(2, 'Mark Rodrigues', datetime.date(2004, 1, 26), 19, 'M', 'CS', 8.0, 179000.0, 'BOSTON')
(3, 'Leslie Rodrigues', datetime.date(2004, 8, 29), 21, 'M', 'CS', 7.0, 170000.0, 'BOSTON')
(4, 'Caleb Rodrigues', datetime.date(2013, 12, 28), 10, 'M', 'CS', 3.0, 130000.0, 'OHIO')
(5, 'Valencio Rodrigues', datetime.date(2001, 4, 12), 22, 'M', 'B', 5.0, 205000.0, 'BOSTON')
(6, 'Vanessa Rodrigues', datetime.date(2000, 1, 27), 23, 'F', 'FD', 4.0, 120000.0, 'WASHINGTON')
(10, 'Roshaun Rodrigues', datetime.date(2003, 8, 19), 20, 'M', 'IT', 3.0, 159000.0, 'VEGAS')

In [42]:
res = return_result('select * from employee_details where Name like "_a%" and Name like "%gue_" ')
for i in res :
    print(i)

(2, 'Mark Rodrigues', datetime.date(2004, 1, 26), 19, 'M', 'CS', 8.0, 179000.0, 'BOSTON')
(4, 'Caleb Rodrigues', datetime.date(2013, 12, 28), 10, 'M', 'CS', 3.0, 130000.0, 'OHIO')
(5, 'Valencio Rodrigues', datetime.date(2001, 4, 12), 22, 'M', 'B', 5.0, 205000.0, 'BOSTON')
(6, 'Vanessa Rodrigues', datetime.date(2000, 1, 27), 23, 'F', 'FD', 4.0, 120000.0, 'WASHINGTON')

### using between

In [43]:
res = return_result('select * from employee_details where year(D_O_J) between "2010" and "2020" ')
for i in res :
    print(i)

(4, 'Caleb Rodrigues', datetime.date(2013, 12, 28), 10, 'M', 'CS', 3.0, 130000.0, 'OHIO')
(9, 'Llyod Mascarenhas', datetime.date(2020, 11, 27), 3, 'M', 'CS', 2.0, 75000.0, 'WASHINGTON')
(14, 'Rajesh', datetime.date(2013, 9, 18), 29, 'F', 'B', 8.0, 84000.0, 'SEATTLE')

### Limit clause

In [44]:
res = return_result('select * from employee_details limit 3')
for i in res :
    print(i)

(1, 'Anthony Rodrigues', datetime.date(2006, 2, 8), 17, 'M', 'AI', 8.0, 200000.0, 'BOSTON')
(2, 'Mark Rodrigues', datetime.date(2004, 1, 26), 19, 'M', 'CS', 8.0, 179000.0, 'BOSTON')
(3, 'Leslie Rodrigues', datetime.date(2004, 8, 29), 21, 'M', 'CS', 7.0, 170000.0, 'BOSTON')

In [45]:
res = return_result('select * from employee_details where Age > 50 limit 3')
for i in res :
    print(i)

(12, 'Salu Bhai', datetime.date(1999, 6, 25), 53, 'M', 'IT', 7.0, 57000.0, 'SEATTLE')
(15, 'Bimles', datetime.date(2006, 9, 18), 59, 'F', 'FD', 6.0, 58662.2, 'WASHINGTON')

### Group by clause

In [46]:
return_result('select Department, avg(Salary) from employee_details group by Department')

[('AI', 185000.0),
 ('CS', 133333.33333333334),
 ('B', 144500.0),
 ('FD', 89331.125),
 ('IT', 92666.66666666667)]

In [47]:
return_result('select City, avg(Salary) from employee_details where city in ("BOSTON","OHIO") group by City')

[('BOSTON', 188500.0), ('OHIO', 102000.0)]

In [48]:
return_result('select City, count(Name) as No_of_Emp from employee_details group by City having count(Name)>2')

[('BOSTON', 4), ('OHIO', 3), ('WASHINGTON', 3), ('VEGAS', 3)]

### Order by

In [49]:
return_result('select City, count(Name) as No_of_Emp from employee_details where City != "Seattle" group by City order by City desc')

[('WASHINGTON', 3), ('VEGAS', 3), ('OHIO', 3), ('BOSTON', 4)]

In [50]:
return_result('select City,character_length(City) from employee_details group by City order by character_length(City) asc')

[('OHIO', 4), ('VEGAS', 5), ('BOSTON', 6), ('SEATTLE', 7), ('WASHINGTON', 10)]

In [51]:
return_result('select year(D_O_J),count(D_O_J) from employee_details group by year(D_O_J) order by year(D_O_J) asc limit 5')

[(1999, 1), (2000, 1), (2001, 1), (2003, 1), (2004, 3)]

### having clause

In [52]:
return_result( 'select Department, avg(Salary) from employee_details where  Department != "CS" group by Department having avg(Salary) > 160000 order by avg(Salary) desc')

[('AI', 185000.0)]

### update statement

In [53]:
execute_query('update employee_details set Salary = Salary * 1.25 where Department = "FD"') #25% hike
return_result( 'select Department, avg(Salary) from employee_details where  Department != "CS" group by Department')

Query executed successfully

[('AI', 185000.0),
 ('B', 144500.0),
 ('FD', 111663.90625),
 ('IT', 92666.66666666667)]

### Truncate statement 
delete all records but not the table

In [54]:
tabs = '''create table garbage(ID int not null primary key auto_increment,
Applications_created varchar(20), 
Current_Assignment varchar(30))'''

execute_query( tabs)

inserts ='''insert into garbage(Applications_created, Current_Assignment ) 
values ('web chatbot','recommendation_system'),
('web_backend','software updates')'''

execute_query( inserts)

result = return_result( 'select * from garbage')
for i in result:
    print(i)

Query executed successfully
Query executed successfully
(1, 'web chatbot', 'recommendation_system')
(2, 'web_backend', 'software updates')

In [55]:
execute_query('truncate table garbage;')
return_result( 'select * from garbage')

Query executed successfully

[]

In [56]:
execute_query('drop table garbage;')

Query executed successfully

In [57]:
return_result('show tables;')

[('emp2',),
 ('employee',),
 ('employee_details',),
 ('entries',),
 ('position_',),
 ('records',),
 ('work_details',)]

### Joins

### inner join - displays records which are present in both the tables

In [58]:
execute_query('drop table if exists employee_work;')

tab2 = '''create table employee_work(ID int not null primary key auto_increment,
Applications_created varchar(20) default "Model fashion design", 
Current_Assignment varchar(30))'''

execute_query( tab2)

insert_tab2 = '''insert into employee_work(Applications_created, Current_Assignment ) 
values ('web chatbot','recommendation_system'),
('web_backend','software updates'),
('web_design','updates'),
('web_design','additional tools'),
('Business analysis','Progress Ideas'),
(default,''),
('web_design','additional'),
('web_backend','software updates'),
('web_design','updates'),
('Hardware Malfunction','Debugging'),
('Hardware Malfunction','Debugging'),
('Hardware Malfunction','Debugging'),
('web chatbot','reccomendation_system'),
('Business analysis','Progress Ideas')'''

execute_query( insert_tab2)

Query executed successfully
Query executed successfully
Query executed successfully

In [59]:
return_result('show tables;')

[('emp2',),
 ('employee',),
 ('employee_details',),
 ('employee_work',),
 ('entries',),
 ('position_',),
 ('records',),
 ('work_details',)]

In [60]:
return_result( 'select * from employee_work ')

[(1, 'web chatbot', 'recommendation_system'),
 (2, 'web_backend', 'software updates'),
 (3, 'web_design', 'updates'),
 (4, 'web_design', 'additional tools'),
 (5, 'Business analysis', 'Progress Ideas'),
 (6, 'Model fashion design', ''),
 (7, 'web_design', 'additional'),
 (8, 'web_backend', 'software updates'),
 (9, 'web_design', 'updates'),
 (10, 'Hardware Malfunction', 'Debugging'),
 (11, 'Hardware Malfunction', 'Debugging'),
 (12, 'Hardware Malfunction', 'Debugging'),
 (13, 'web chatbot', 'reccomendation_system'),
 (14, 'Business analysis', 'Progress Ideas')]

In [61]:
# Here the 15th record is deleted becoz its not present in one table 
return_result( 'select d.EmployeeId, d.Name, d.Department, w.Applications_created, w.Current_Assignment from employee_details as d inner join employee_work as w where d.EmployeeId=w.ID')

[(1, 'Anthony Rodrigues', 'AI', 'web chatbot', 'recommendation_system'),
 (2, 'Mark Rodrigues', 'CS', 'web_backend', 'software updates'),
 (3, 'Leslie Rodrigues', 'CS', 'web_design', 'updates'),
 (4, 'Caleb Rodrigues', 'CS', 'web_design', 'additional tools'),
 (5, 'Valencio Rodrigues', 'B', 'Business analysis', 'Progress Ideas'),
 (6, 'Vanessa Rodrigues', 'FD', 'Model fashion design', ''),
 (7, 'Sharon Mascarenhas', 'CS', 'web_design', 'additional'),
 (8, 'Steven Mascarenhas', 'CS', 'web_backend', 'software updates'),
 (9, 'Llyod Mascarenhas', 'CS', 'web_design', 'updates'),
 (10, 'Roshaun Rodrigues', 'IT', 'Hardware Malfunction', 'Debugging'),
 (11, 'Russel Ambatti', 'IT', 'Hardware Malfunction', 'Debugging'),
 (12, 'Salu Bhai', 'IT', 'Hardware Malfunction', 'Debugging'),
 (13, 'P town', 'AI', 'web chatbot', 'reccomendation_system'),
 (14, 'Rajesh', 'B', 'Business analysis', 'Progress Ideas')]

### right join

In [62]:
res = return_result( 'select * from employee_details')
for i in res:
    print(i)

(1, 'Anthony Rodrigues', datetime.date(2006, 2, 8), 17, 'M', 'AI', 8.0, 200000.0, 'BOSTON')
(2, 'Mark Rodrigues', datetime.date(2004, 1, 26), 19, 'M', 'CS', 8.0, 179000.0, 'BOSTON')
(3, 'Leslie Rodrigues', datetime.date(2004, 8, 29), 21, 'M', 'CS', 7.0, 170000.0, 'BOSTON')
(4, 'Caleb Rodrigues', datetime.date(2013, 12, 28), 10, 'M', 'CS', 3.0, 130000.0, 'OHIO')
(5, 'Valencio Rodrigues', datetime.date(2001, 4, 12), 22, 'M', 'B', 5.0, 205000.0, 'BOSTON')
(6, 'Vanessa Rodrigues', datetime.date(2000, 1, 27), 23, 'F', 'FD', 4.0, 150000.0, 'WASHINGTON')
(7, 'Sharon Mascarenhas', datetime.date(2004, 8, 3), 19, 'F', 'CS', 4.0, 132000.0, 'VEGAS')
(8, 'Steven Mascarenhas', datetime.date(2008, 7, 26), 15, 'M', 'CS', 2.0, 114000.0, 'OHIO')
(9, 'Llyod Mascarenhas', datetime.date(2020, 11, 27), 3, 'M', 'CS', 2.0, 75000.0, 'WASHINGTON')
(10, 'Roshaun Rodrigues', datetime.date(2003, 8, 19), 20, 'M', 'IT', 3.0, 159000.0, 'VEGAS')
(11, 'Russel Ambatti', datetime.date(2006, 6, 7), 17, 'M', 'IT', 1.0, 62000.0, 'OHIO')
(12, 'Salu Bhai', datetime.date(1999, 6, 25), 53, 'M', 'IT', 7.0, 57000.0, 'SEATTLE')
(13, 'P town', datetime.date(2009, 6, 10), 24, 'M', 'AI', 5.0, 170000.0, 'VEGAS')
(14, 'Rajesh', datetime.date(2013, 9, 18), 29, 'F', 'B', 8.0, 84000.0, 'SEATTLE')
(15, 'Bimles', datetime.date(2006, 9, 18), 59, 'F', 'FD', 6.0, 73327.8, 'WASHINGTON')

In [63]:
#here the 15th record is deleted bcz the table in the right does not have 15th record even if the left table does
# it shows even if its null  
res = return_result('select Id, Name, Applications_created, Current_Assignment from employee_details as d right join employee_work as w on d.EmployeeId = w.ID')
for i in res:
    print(i)

(1, 'Anthony Rodrigues', 'web chatbot', 'recommendation_system')
(2, 'Mark Rodrigues', 'web_backend', 'software updates')
(3, 'Leslie Rodrigues', 'web_design', 'updates')
(4, 'Caleb Rodrigues', 'web_design', 'additional tools')
(5, 'Valencio Rodrigues', 'Business analysis', 'Progress Ideas')
(6, 'Vanessa Rodrigues', 'Model fashion design', '')
(7, 'Sharon Mascarenhas', 'web_design', 'additional')
(8, 'Steven Mascarenhas', 'web_backend', 'software updates')
(9, 'Llyod Mascarenhas', 'web_design', 'updates')
(10, 'Roshaun Rodrigues', 'Hardware Malfunction', 'Debugging')
(11, 'Russel Ambatti', 'Hardware Malfunction', 'Debugging')
(12, 'Salu Bhai', 'Hardware Malfunction', 'Debugging')
(13, 'P town', 'web chatbot', 'reccomendation_system')
(14, 'Rajesh', 'Business analysis', 'Progress Ideas')

### left join

### delete statement
delete records falling under specific condition

In [64]:
execute_query('Delete from employee_details where Name = "Russel Ambatti"')

Query executed successfully

In [65]:
res = return_result( 'select * from employee_work')
for i in res:
    print(i)

(1, 'web chatbot', 'recommendation_system')
(2, 'web_backend', 'software updates')
(3, 'web_design', 'updates')
(4, 'web_design', 'additional tools')
(5, 'Business analysis', 'Progress Ideas')
(6, 'Model fashion design', '')
(7, 'web_design', 'additional')
(8, 'web_backend', 'software updates')
(9, 'web_design', 'updates')
(10, 'Hardware Malfunction', 'Debugging')
(11, 'Hardware Malfunction', 'Debugging')
(12, 'Hardware Malfunction', 'Debugging')
(13, 'web chatbot', 'reccomendation_system')
(14, 'Business analysis', 'Progress Ideas')

### here the 11th record is deleted bcz the table the left does not have 11th record even if the right table does it shows even if its null

In [66]:

res = return_result('select Id, Name, Current_Assignment from employee_details as d left join  employee_work as w on d.EmployeeId = w.ID')
for i in res:
    print(i)

(1, 'Anthony Rodrigues', 'recommendation_system')
(2, 'Mark Rodrigues', 'software updates')
(3, 'Leslie Rodrigues', 'updates')
(4, 'Caleb Rodrigues', 'additional tools')
(5, 'Valencio Rodrigues', 'Progress Ideas')
(6, 'Vanessa Rodrigues', '')
(7, 'Sharon Mascarenhas', 'additional')
(8, 'Steven Mascarenhas', 'software updates')
(9, 'Llyod Mascarenhas', 'updates')
(10, 'Roshaun Rodrigues', 'Debugging')
(12, 'Salu Bhai', 'Debugging')
(13, 'P town', 'reccomendation_system')
(14, 'Rajesh', 'Progress Ideas')
(None, 'Bimles', None)

### full join

### whichever records are deleted are shown as None/Null if for the same record data is present in other table itll  be shown

In [67]:
res = return_result( 'select d.EmployeeId, d.Name, w.Current_Assignment from employee_details as d right join employee_work as w on d.EmployeeId = w.ID union select EmployeeId, Name, w.Current_Assignment from employee_details as d left join employee_work as w on d.EmployeeId = w.ID')
for i in res:
    print(i)

(1, 'Anthony Rodrigues', 'recommendation_system')
(2, 'Mark Rodrigues', 'software updates')
(3, 'Leslie Rodrigues', 'updates')
(4, 'Caleb Rodrigues', 'additional tools')
(5, 'Valencio Rodrigues', 'Progress Ideas')
(6, 'Vanessa Rodrigues', '')
(7, 'Sharon Mascarenhas', 'additional')
(8, 'Steven Mascarenhas', 'software updates')
(9, 'Llyod Mascarenhas', 'updates')
(10, 'Roshaun Rodrigues', 'Debugging')
(None, None, 'Debugging')
(12, 'Salu Bhai', 'Debugging')
(13, 'P town', 'reccomendation_system')
(14, 'Rajesh', 'Progress Ideas')
(15, 'Bimles', None)

### Update and Delete using joins (Remember these statements will execute as per join, if inner join record will be updated/deleted only if present in both tables similary right/left join if present in right/left table  )

In [68]:
execute_query( "update employee_details inner join employee_work on employee_details.EmployeeId = employee_work.Id set Salary = Salary * 1.25 where Department != 'FD' ")

Query executed successfully

In [69]:
res = return_result( 'select * from employee_details')
for i in res:
    print(i)

(1, 'Anthony Rodrigues', datetime.date(2006, 2, 8), 17, 'M', 'AI', 8.0, 250000.0, 'BOSTON')
(2, 'Mark Rodrigues', datetime.date(2004, 1, 26), 19, 'M', 'CS', 8.0, 223750.0, 'BOSTON')
(3, 'Leslie Rodrigues', datetime.date(2004, 8, 29), 21, 'M', 'CS', 7.0, 212500.0, 'BOSTON')
(4, 'Caleb Rodrigues', datetime.date(2013, 12, 28), 10, 'M', 'CS', 3.0, 162500.0, 'OHIO')
(5, 'Valencio Rodrigues', datetime.date(2001, 4, 12), 22, 'M', 'B', 5.0, 256250.0, 'BOSTON')
(6, 'Vanessa Rodrigues', datetime.date(2000, 1, 27), 23, 'F', 'FD', 4.0, 150000.0, 'WASHINGTON')
(7, 'Sharon Mascarenhas', datetime.date(2004, 8, 3), 19, 'F', 'CS', 4.0, 165000.0, 'VEGAS')
(8, 'Steven Mascarenhas', datetime.date(2008, 7, 26), 15, 'M', 'CS', 2.0, 142500.0, 'OHIO')
(9, 'Llyod Mascarenhas', datetime.date(2020, 11, 27), 3, 'M', 'CS', 2.0, 93750.0, 'WASHINGTON')
(10, 'Roshaun Rodrigues', datetime.date(2003, 8, 19), 20, 'M', 'IT', 3.0, 198750.0, 'VEGAS')
(12, 'Salu Bhai', datetime.date(1999, 6, 25), 53, 'M', 'IT', 7.0, 71250.0, 'SEATTLE')
(13, 'P town', datetime.date(2009, 6, 10), 24, 'M', 'AI', 5.0, 212500.0, 'VEGAS')
(14, 'Rajesh', datetime.date(2013, 9, 18), 29, 'F', 'B', 8.0, 105000.0, 'SEATTLE')
(15, 'Bimles', datetime.date(2006, 9, 18), 59, 'F', 'FD', 6.0, 73327.8, 'WASHINGTON')

In [70]:
execute_query( "delete employee_details, employee_work from employee_details inner join employee_work on employee_details.EmployeeId = employee_work.Id where Department = 'FD'  ")

Query executed successfully

### here the 6th records is deleted and 15th rec is not deleted bcz its is not present in one table so the id  doesnt match so left there

In [71]:
res = return_result( 'select * from employee_details')
for i in res:
    print(i)

(1, 'Anthony Rodrigues', datetime.date(2006, 2, 8), 17, 'M', 'AI', 8.0, 250000.0, 'BOSTON')
(2, 'Mark Rodrigues', datetime.date(2004, 1, 26), 19, 'M', 'CS', 8.0, 223750.0, 'BOSTON')
(3, 'Leslie Rodrigues', datetime.date(2004, 8, 29), 21, 'M', 'CS', 7.0, 212500.0, 'BOSTON')
(4, 'Caleb Rodrigues', datetime.date(2013, 12, 28), 10, 'M', 'CS', 3.0, 162500.0, 'OHIO')
(5, 'Valencio Rodrigues', datetime.date(2001, 4, 12), 22, 'M', 'B', 5.0, 256250.0, 'BOSTON')
(7, 'Sharon Mascarenhas', datetime.date(2004, 8, 3), 19, 'F', 'CS', 4.0, 165000.0, 'VEGAS')
(8, 'Steven Mascarenhas', datetime.date(2008, 7, 26), 15, 'M', 'CS', 2.0, 142500.0, 'OHIO')
(9, 'Llyod Mascarenhas', datetime.date(2020, 11, 27), 3, 'M', 'CS', 2.0, 93750.0, 'WASHINGTON')
(10, 'Roshaun Rodrigues', datetime.date(2003, 8, 19), 20, 'M', 'IT', 3.0, 198750.0, 'VEGAS')
(12, 'Salu Bhai', datetime.date(1999, 6, 25), 53, 'M', 'IT', 7.0, 71250.0, 'SEATTLE')
(13, 'P town', datetime.date(2009, 6, 10), 24, 'M', 'AI', 5.0, 212500.0, 'VEGAS')
(14, 'Rajesh', datetime.date(2013, 9, 18), 29, 'F', 'B', 8.0, 105000.0, 'SEATTLE')
(15, 'Bimles', datetime.date(2006, 9, 18), 59, 'F', 'FD', 6.0, 73327.8, 'WASHINGTON')

### union operator
shows only unique records i.e even if one record is different itll show the rec

In [72]:
execute_query( 'drop table emp2')

Query executed successfully

In [73]:
tab3 = """create table emp2(Employee_id int primary key,
Name varchar(20),
D_O_J date, 
Age int, 
Gender char(1),
Dept varchar(10), 
Exp float, 
Sal float,
City varchar(20));"""

execute_query( tab3)

Query executed successfully

In [74]:
insert_tab3= """ insert into emp2(Employee_id, Name, D_O_J, Age, Gender, Dept, Exp, Sal, City)
values (1, 'Anthony Rodrigues', '2006-02-08', 17, 'M', 'AI', 8.0, 250000.0, 'BOSTON')
,(2, 'Mark Rodrigues','2004-01-26', 19, 'M', 'CS', 8.0, 223750.0, 'BOSTON')
,(3, 'Leslie Rodrigues','2002-08-29', 21, 'M', 'CS', 7.0, 212500.0, 'BOSTON')
,(4, 'Caleb Rodrigues','2013-12-28', 10, 'M', 'CS', 3.0, 162500.0, 'OHIO')
,(5, 'Valencio Rodrigues','2001-04-12', 22, 'M', 'B', 5.0, 256250.0, 'BOSTON')
,(7, 'Sharon Mascarenhas','2004-08-03', 19, 'F', 'CS', 4.0, 165000.0, 'VEGAS')
,(8, 'Steven Mascarenhas','2008-07-26', 15, 'M', 'CS', 2.0, 142500.0, 'OHIO')
,(9, 'Llyod Mascarenhas','2020-11-27', 3, 'M', 'CS', 2.0, 93750.0, 'WASHINGTON')
,(10, 'Roshaun Rodrigues','2003-08-19', 20, 'M', 'IT', 3.0, 198750.0, 'VEGAS')
,(11, 'Raju Singh','2006-08-02','17','M','IT','8','100000','BOSTON')
,(12, 'Kaju Singh','2006-08-02','17','M','IT','8','100000','BOSTON')"""

execute_query( insert_tab3)

Query executed successfully

In [75]:
insert2_tab3= """ insert into emp2(Employee_id Name, D_O_J,  Age, Gender, Dept, Exp, Sal, City)
values(11'Raju Singh','2006-08-02','17','M','IT','8','100000','BOSTON');"""

execute_query( insert_tab3)

Error: 1062 (23000): Duplicate entry '1' for key 'emp2.PRIMARY'

In [76]:
res = return_result( 'select * from emp2')
for i in res:
    print(i)

(1, 'Anthony Rodrigues', datetime.date(2006, 2, 8), 17, 'M', 'AI', 8.0, 250000.0, 'BOSTON')
(2, 'Mark Rodrigues', datetime.date(2004, 1, 26), 19, 'M', 'CS', 8.0, 223750.0, 'BOSTON')
(3, 'Leslie Rodrigues', datetime.date(2002, 8, 29), 21, 'M', 'CS', 7.0, 212500.0, 'BOSTON')
(4, 'Caleb Rodrigues', datetime.date(2013, 12, 28), 10, 'M', 'CS', 3.0, 162500.0, 'OHIO')
(5, 'Valencio Rodrigues', datetime.date(2001, 4, 12), 22, 'M', 'B', 5.0, 256250.0, 'BOSTON')
(7, 'Sharon Mascarenhas', datetime.date(2004, 8, 3), 19, 'F', 'CS', 4.0, 165000.0, 'VEGAS')
(8, 'Steven Mascarenhas', datetime.date(2008, 7, 26), 15, 'M', 'CS', 2.0, 142500.0, 'OHIO')
(9, 'Llyod Mascarenhas', datetime.date(2020, 11, 27), 3, 'M', 'CS', 2.0, 93750.0, 'WASHINGTON')
(10, 'Roshaun Rodrigues', datetime.date(2003, 8, 19), 20, 'M', 'IT', 3.0, 198750.0, 'VEGAS')
(11, 'Raju Singh', datetime.date(2006, 8, 2), 17, 'M', 'IT', 8.0, 100000.0, 'BOSTON')
(12, 'Kaju Singh', datetime.date(2006, 8, 2), 17, 'M', 'IT', 8.0, 100000.0, 'BOSTON')

In [77]:
#which ever records are entirely same i.e. first 10 are shown only once the others are unique so they are shown
res = return_result( 'select * from employee_details union select * from emp2;')
for i in res:
    print(i)

(1, 'Anthony Rodrigues', datetime.date(2006, 2, 8), 17, 'M', 'AI', 8.0, 250000.0, 'BOSTON')
(2, 'Mark Rodrigues', datetime.date(2004, 1, 26), 19, 'M', 'CS', 8.0, 223750.0, 'BOSTON')
(3, 'Leslie Rodrigues', datetime.date(2004, 8, 29), 21, 'M', 'CS', 7.0, 212500.0, 'BOSTON')
(4, 'Caleb Rodrigues', datetime.date(2013, 12, 28), 10, 'M', 'CS', 3.0, 162500.0, 'OHIO')
(5, 'Valencio Rodrigues', datetime.date(2001, 4, 12), 22, 'M', 'B', 5.0, 256250.0, 'BOSTON')
(7, 'Sharon Mascarenhas', datetime.date(2004, 8, 3), 19, 'F', 'CS', 4.0, 165000.0, 'VEGAS')
(8, 'Steven Mascarenhas', datetime.date(2008, 7, 26), 15, 'M', 'CS', 2.0, 142500.0, 'OHIO')
(9, 'Llyod Mascarenhas', datetime.date(2020, 11, 27), 3, 'M', 'CS', 2.0, 93750.0, 'WASHINGTON')
(10, 'Roshaun Rodrigues', datetime.date(2003, 8, 19), 20, 'M', 'IT', 3.0, 198750.0, 'VEGAS')
(12, 'Salu Bhai', datetime.date(1999, 6, 25), 53, 'M', 'IT', 7.0, 71250.0, 'SEATTLE')
(13, 'P town', datetime.date(2009, 6, 10), 24, 'M', 'AI', 5.0, 212500.0, 'VEGAS')
(14, 'Rajesh', datetime.date(2013, 9, 18), 29, 'F', 'B', 8.0, 105000.0, 'SEATTLE')
(15, 'Bimles', datetime.date(2006, 9, 18), 59, 'F', 'FD', 6.0, 73327.8, 'WASHINGTON')
(3, 'Leslie Rodrigues', datetime.date(2002, 8, 29), 21, 'M', 'CS', 7.0, 212500.0, 'BOSTON')
(11, 'Raju Singh', datetime.date(2006, 8, 2), 17, 'M', 'IT', 8.0, 100000.0, 'BOSTON')
(12, 'Kaju Singh', datetime.date(2006, 8, 2), 17, 'M', 'IT', 8.0, 100000.0, 'BOSTON')

### union all operator
shows all records whether duplicate or not

In [78]:
#here records are shown without any looking into it
res = return_result( 'select * from employee_details union all select * from emp2;')
for i in res:
    print(i)

(1, 'Anthony Rodrigues', datetime.date(2006, 2, 8), 17, 'M', 'AI', 8.0, 250000.0, 'BOSTON')
(2, 'Mark Rodrigues', datetime.date(2004, 1, 26), 19, 'M', 'CS', 8.0, 223750.0, 'BOSTON')
(3, 'Leslie Rodrigues', datetime.date(2004, 8, 29), 21, 'M', 'CS', 7.0, 212500.0, 'BOSTON')
(4, 'Caleb Rodrigues', datetime.date(2013, 12, 28), 10, 'M', 'CS', 3.0, 162500.0, 'OHIO')
(5, 'Valencio Rodrigues', datetime.date(2001, 4, 12), 22, 'M', 'B', 5.0, 256250.0, 'BOSTON')
(7, 'Sharon Mascarenhas', datetime.date(2004, 8, 3), 19, 'F', 'CS', 4.0, 165000.0, 'VEGAS')
(8, 'Steven Mascarenhas', datetime.date(2008, 7, 26), 15, 'M', 'CS', 2.0, 142500.0, 'OHIO')
(9, 'Llyod Mascarenhas', datetime.date(2020, 11, 27), 3, 'M', 'CS', 2.0, 93750.0, 'WASHINGTON')
(10, 'Roshaun Rodrigues', datetime.date(2003, 8, 19), 20, 'M', 'IT', 3.0, 198750.0, 'VEGAS')
(12, 'Salu Bhai', datetime.date(1999, 6, 25), 53, 'M', 'IT', 7.0, 71250.0, 'SEATTLE')
(13, 'P town', datetime.date(2009, 6, 10), 24, 'M', 'AI', 5.0, 212500.0, 'VEGAS')
(14, 'Rajesh', datetime.date(2013, 9, 18), 29, 'F', 'B', 8.0, 105000.0, 'SEATTLE')
(15, 'Bimles', datetime.date(2006, 9, 18), 59, 'F', 'FD', 6.0, 73327.8, 'WASHINGTON')
(1, 'Anthony Rodrigues', datetime.date(2006, 2, 8), 17, 'M', 'AI', 8.0, 250000.0, 'BOSTON')
(2, 'Mark Rodrigues', datetime.date(2004, 1, 26), 19, 'M', 'CS', 8.0, 223750.0, 'BOSTON')
(3, 'Leslie Rodrigues', datetime.date(2002, 8, 29), 21, 'M', 'CS', 7.0, 212500.0, 'BOSTON')
(4, 'Caleb Rodrigues', datetime.date(2013, 12, 28), 10, 'M', 'CS', 3.0, 162500.0, 'OHIO')
(5, 'Valencio Rodrigues', datetime.date(2001, 4, 12), 22, 'M', 'B', 5.0, 256250.0, 'BOSTON')
(7, 'Sharon Mascarenhas', datetime.date(2004, 8, 3), 19, 'F', 'CS', 4.0, 165000.0, 'VEGAS')
(8, 'Steven Mascarenhas', datetime.date(2008, 7, 26), 15, 'M', 'CS', 2.0, 142500.0, 'OHIO')
(9, 'Llyod Mascarenhas', datetime.date(2020, 11, 27), 3, 'M', 'CS', 2.0, 93750.0, 'WASHINGTON')
(10, 'Roshaun Rodrigues', datetime.date(2003, 8, 19), 20, 'M', 'IT', 3.0, 198750.0, 'VEGAS')
(11, 'Raju Singh', datetime.date(2006, 8, 2), 17, 'M', 'IT', 8.0, 100000.0, 'BOSTON')
(12, 'Kaju Singh', datetime.date(2006, 8, 2), 17, 'M', 'IT', 8.0, 100000.0, 'BOSTON')

In [79]:
execute_query('update emp2 set Sal = Sal *1.2 ')

Query executed successfully

### except operator
shows the records present in the first table and not in the second

In [80]:
res = return_result( 'select * from employee_details except select * from emp2 where Dept != "AI";')
#show unique only when dept != Ai if dept = Ai show even if present
for i in res:
    print(i)

(1, 'Anthony Rodrigues', datetime.date(2006, 2, 8), 17, 'M', 'AI', 8.0, 250000.0, 'BOSTON')
(2, 'Mark Rodrigues', datetime.date(2004, 1, 26), 19, 'M', 'CS', 8.0, 223750.0, 'BOSTON')
(3, 'Leslie Rodrigues', datetime.date(2004, 8, 29), 21, 'M', 'CS', 7.0, 212500.0, 'BOSTON')
(4, 'Caleb Rodrigues', datetime.date(2013, 12, 28), 10, 'M', 'CS', 3.0, 162500.0, 'OHIO')
(5, 'Valencio Rodrigues', datetime.date(2001, 4, 12), 22, 'M', 'B', 5.0, 256250.0, 'BOSTON')
(7, 'Sharon Mascarenhas', datetime.date(2004, 8, 3), 19, 'F', 'CS', 4.0, 165000.0, 'VEGAS')
(8, 'Steven Mascarenhas', datetime.date(2008, 7, 26), 15, 'M', 'CS', 2.0, 142500.0, 'OHIO')
(9, 'Llyod Mascarenhas', datetime.date(2020, 11, 27), 3, 'M', 'CS', 2.0, 93750.0, 'WASHINGTON')
(10, 'Roshaun Rodrigues', datetime.date(2003, 8, 19), 20, 'M', 'IT', 3.0, 198750.0, 'VEGAS')
(12, 'Salu Bhai', datetime.date(1999, 6, 25), 53, 'M', 'IT', 7.0, 71250.0, 'SEATTLE')
(13, 'P town', datetime.date(2009, 6, 10), 24, 'M', 'AI', 5.0, 212500.0, 'VEGAS')
(14, 'Rajesh', datetime.date(2013, 9, 18), 29, 'F', 'B', 8.0, 105000.0, 'SEATTLE')
(15, 'Bimles', datetime.date(2006, 9, 18), 59, 'F', 'FD', 6.0, 73327.8, 'WASHINGTON')

In [81]:
res = return_result( 'select * from emp2 except select * from employee_details ')
for i in res:
    print(i)

(1, 'Anthony Rodrigues', datetime.date(2006, 2, 8), 17, 'M', 'AI', 8.0, 300000.0, 'BOSTON')
(2, 'Mark Rodrigues', datetime.date(2004, 1, 26), 19, 'M', 'CS', 8.0, 268500.0, 'BOSTON')
(3, 'Leslie Rodrigues', datetime.date(2002, 8, 29), 21, 'M', 'CS', 7.0, 255000.0, 'BOSTON')
(4, 'Caleb Rodrigues', datetime.date(2013, 12, 28), 10, 'M', 'CS', 3.0, 195000.0, 'OHIO')
(5, 'Valencio Rodrigues', datetime.date(2001, 4, 12), 22, 'M', 'B', 5.0, 307500.0, 'BOSTON')
(7, 'Sharon Mascarenhas', datetime.date(2004, 8, 3), 19, 'F', 'CS', 4.0, 198000.0, 'VEGAS')
(8, 'Steven Mascarenhas', datetime.date(2008, 7, 26), 15, 'M', 'CS', 2.0, 171000.0, 'OHIO')
(9, 'Llyod Mascarenhas', datetime.date(2020, 11, 27), 3, 'M', 'CS', 2.0, 112500.0, 'WASHINGTON')
(10, 'Roshaun Rodrigues', datetime.date(2003, 8, 19), 20, 'M', 'IT', 3.0, 238500.0, 'VEGAS')
(11, 'Raju Singh', datetime.date(2006, 8, 2), 17, 'M', 'IT', 8.0, 120000.0, 'BOSTON')
(12, 'Kaju Singh', datetime.date(2006, 8, 2), 17, 'M', 'IT', 8.0, 120000.0, 'BOSTON')

### intersect operater
shows the records present in first table which are common in the second table too

In [82]:
res = return_result( 'select * from employee_details intersect select * from emp2 ')
for i in res:
    print(i)

### as nothing is common we dont see any output

In [83]:
res = return_result('select * from employee_details')
for i in res:
    print(i)

(1, 'Anthony Rodrigues', datetime.date(2006, 2, 8), 17, 'M', 'AI', 8.0, 250000.0, 'BOSTON')
(2, 'Mark Rodrigues', datetime.date(2004, 1, 26), 19, 'M', 'CS', 8.0, 223750.0, 'BOSTON')
(3, 'Leslie Rodrigues', datetime.date(2004, 8, 29), 21, 'M', 'CS', 7.0, 212500.0, 'BOSTON')
(4, 'Caleb Rodrigues', datetime.date(2013, 12, 28), 10, 'M', 'CS', 3.0, 162500.0, 'OHIO')
(5, 'Valencio Rodrigues', datetime.date(2001, 4, 12), 22, 'M', 'B', 5.0, 256250.0, 'BOSTON')
(7, 'Sharon Mascarenhas', datetime.date(2004, 8, 3), 19, 'F', 'CS', 4.0, 165000.0, 'VEGAS')
(8, 'Steven Mascarenhas', datetime.date(2008, 7, 26), 15, 'M', 'CS', 2.0, 142500.0, 'OHIO')
(9, 'Llyod Mascarenhas', datetime.date(2020, 11, 27), 3, 'M', 'CS', 2.0, 93750.0, 'WASHINGTON')
(10, 'Roshaun Rodrigues', datetime.date(2003, 8, 19), 20, 'M', 'IT', 3.0, 198750.0, 'VEGAS')
(12, 'Salu Bhai', datetime.date(1999, 6, 25), 53, 'M', 'IT', 7.0, 71250.0, 'SEATTLE')
(13, 'P town', datetime.date(2009, 6, 10), 24, 'M', 'AI', 5.0, 212500.0, 'VEGAS')
(14, 'Rajesh', datetime.date(2013, 9, 18), 29, 'F', 'B', 8.0, 105000.0, 'SEATTLE')
(15, 'Bimles', datetime.date(2006, 9, 18), 59, 'F', 'FD', 6.0, 73327.8, 'WASHINGTON')

### views
a virtual table based on the result-set of an SQL statement.

In [84]:
execute_query('create view Emp_New as select Name,City from employee_details')

Query executed successfully

#### viewing views

In [85]:
res = return_result( 'show full tables where table_type = "VIEW" ')
for i in res:
    print(i)

('emp_new', 'VIEW')
('work_details', 'VIEW')

In [86]:
res = return_result( 'select * from emp_NEW ')
for i in res:
    print(i)

('Anthony Rodrigues', 'BOSTON')
('Mark Rodrigues', 'BOSTON')
('Leslie Rodrigues', 'BOSTON')
('Caleb Rodrigues', 'OHIO')
('Valencio Rodrigues', 'BOSTON')
('Sharon Mascarenhas', 'VEGAS')
('Steven Mascarenhas', 'OHIO')
('Llyod Mascarenhas', 'WASHINGTON')
('Roshaun Rodrigues', 'VEGAS')
('Salu Bhai', 'SEATTLE')
('P town', 'VEGAS')
('Rajesh', 'SEATTLE')
('Bimles', 'WASHINGTON')

In [87]:
execute_query('create view work_details as select EmployeeId, Name, D_O_J, Age, Gender, Department, Experience, Salary, City, Applications_created, Current_Assignment from employee_details inner join employee_work where employee_details.EmployeeId = employee_work.Id')

Error: 1050 (42S01): Table 'work_details' already exists

In [88]:
res = return_result( 'select * from  work_details')
for i in res:
    print(i)

(1, 'Anthony Rodrigues', datetime.date(2006, 2, 8), 17, 'M', 'AI', 8.0, 250000.0, 'BOSTON', 'web chatbot', 'recommendation_system')
(2, 'Mark Rodrigues', datetime.date(2004, 1, 26), 19, 'M', 'CS', 8.0, 223750.0, 'BOSTON', 'web_backend', 'software updates')
(3, 'Leslie Rodrigues', datetime.date(2004, 8, 29), 21, 'M', 'CS', 7.0, 212500.0, 'BOSTON', 'web_design', 'updates')
(4, 'Caleb Rodrigues', datetime.date(2013, 12, 28), 10, 'M', 'CS', 3.0, 162500.0, 'OHIO', 'web_design', 'additional tools')
(5, 'Valencio Rodrigues', datetime.date(2001, 4, 12), 22, 'M', 'B', 5.0, 256250.0, 'BOSTON', 'Business analysis', 'Progress Ideas')
(7, 'Sharon Mascarenhas', datetime.date(2004, 8, 3), 19, 'F', 'CS', 4.0, 165000.0, 'VEGAS', 'web_design', 'additional')
(8, 'Steven Mascarenhas', datetime.date(2008, 7, 26), 15, 'M', 'CS', 2.0, 142500.0, 'OHIO', 'web_backend', 'software updates')
(9, 'Llyod Mascarenhas', datetime.date(2020, 11, 27), 3, 'M', 'CS', 2.0, 93750.0, 'WASHINGTON', 'web_design', 'updates')
(10, 'Roshaun Rodrigues', datetime.date(2003, 8, 19), 20, 'M', 'IT', 3.0, 198750.0, 'VEGAS', 'Hardware Malfunction', 'Debugging')
(12, 'Salu Bhai', datetime.date(1999, 6, 25), 53, 'M', 'IT', 7.0, 71250.0, 'SEATTLE', 'Hardware Malfunction', 'Debugging')
(13, 'P town', datetime.date(2009, 6, 10), 24, 'M', 'AI', 5.0, 212500.0, 'VEGAS', 'web chatbot', 'reccomendation_system')
(14, 'Rajesh', datetime.date(2013, 9, 18), 29, 'F', 'B', 8.0, 105000.0, 'SEATTLE', 'Business analysis', 'Progress Ideas')

### renaming tables/views

In [89]:
execute_query('rename table emp_new to emp_new1')

Query executed successfully

### deleting views

In [90]:
execute_query('drop view emp_new1')

Query executed successfully

### alter table
used to add delete and modify existing cols

In [91]:
return_result( 'show tables')

[('emp2',),
 ('employee',),
 ('employee_details',),
 ('employee_work',),
 ('entries',),
 ('position_',),
 ('records',),
 ('work_details',)]

#### adding a column

In [92]:
execute_query( 'alter table emp2 add pincode int')
res = return_result( 'select * from emp2')
for i in res:
    print(i)

Query executed successfully
(1, 'Anthony Rodrigues', datetime.date(2006, 2, 8), 17, 'M', 'AI', 8.0, 300000.0, 'BOSTON', None)
(2, 'Mark Rodrigues', datetime.date(2004, 1, 26), 19, 'M', 'CS', 8.0, 268500.0, 'BOSTON', None)
(3, 'Leslie Rodrigues', datetime.date(2002, 8, 29), 21, 'M', 'CS', 7.0, 255000.0, 'BOSTON', None)
(4, 'Caleb Rodrigues', datetime.date(2013, 12, 28), 10, 'M', 'CS', 3.0, 195000.0, 'OHIO', None)
(5, 'Valencio Rodrigues', datetime.date(2001, 4, 12), 22, 'M', 'B', 5.0, 307500.0, 'BOSTON', None)
(7, 'Sharon Mascarenhas', datetime.date(2004, 8, 3), 19, 'F', 'CS', 4.0, 198000.0, 'VEGAS', None)
(8, 'Steven Mascarenhas', datetime.date(2008, 7, 26), 15, 'M', 'CS', 2.0, 171000.0, 'OHIO', None)
(9, 'Llyod Mascarenhas', datetime.date(2020, 11, 27), 3, 'M', 'CS', 2.0, 112500.0, 'WASHINGTON', None)
(10, 'Roshaun Rodrigues', datetime.date(2003, 8, 19), 20, 'M', 'IT', 3.0, 238500.0, 'VEGAS', None)
(11, 'Raju Singh', datetime.date(2006, 8, 2), 17, 'M', 'IT', 8.0, 120000.0, 'BOSTON', None)
(12, 'Kaju Singh', datetime.date(2006, 8, 2), 17, 'M', 'IT', 8.0, 120000.0, 'BOSTON', None)

#### deleting a column

In [93]:
execute_query( 'alter table emp2 drop column pincode')
res = return_result( 'select * from emp2')
for i in res:
    print(i)

Query executed successfully
(1, 'Anthony Rodrigues', datetime.date(2006, 2, 8), 17, 'M', 'AI', 8.0, 300000.0, 'BOSTON')
(2, 'Mark Rodrigues', datetime.date(2004, 1, 26), 19, 'M', 'CS', 8.0, 268500.0, 'BOSTON')
(3, 'Leslie Rodrigues', datetime.date(2002, 8, 29), 21, 'M', 'CS', 7.0, 255000.0, 'BOSTON')
(4, 'Caleb Rodrigues', datetime.date(2013, 12, 28), 10, 'M', 'CS', 3.0, 195000.0, 'OHIO')
(5, 'Valencio Rodrigues', datetime.date(2001, 4, 12), 22, 'M', 'B', 5.0, 307500.0, 'BOSTON')
(7, 'Sharon Mascarenhas', datetime.date(2004, 8, 3), 19, 'F', 'CS', 4.0, 198000.0, 'VEGAS')
(8, 'Steven Mascarenhas', datetime.date(2008, 7, 26), 15, 'M', 'CS', 2.0, 171000.0, 'OHIO')
(9, 'Llyod Mascarenhas', datetime.date(2020, 11, 27), 3, 'M', 'CS', 2.0, 112500.0, 'WASHINGTON')
(10, 'Roshaun Rodrigues', datetime.date(2003, 8, 19), 20, 'M', 'IT', 3.0, 238500.0, 'VEGAS')
(11, 'Raju Singh', datetime.date(2006, 8, 2), 17, 'M', 'IT', 8.0, 120000.0, 'BOSTON')
(12, 'Kaju Singh', datetime.date(2006, 8, 2), 17, 'M', 'IT', 8.0, 120000.0, 'BOSTON')

### insert into....duplicate key
insert, update, and delete statements into a single SQL query

In [94]:
#syntax-
#      insert into name_of_the_updation_table (index_col, cols_to_update)
#      values(replacing_value_index, replacing value)
#      on duplicate key update/delete cols_to_update/delete = value_to_update   


q = '''INSERT INTO emp2 (Employee_id, name) 
VALUES (11,'Raju Singh')
ON DUPLICATE KEY UPDATE name = 'Happy Alhuwalhia';
'''#We can even use delete statement there
execute_query( q)

Query executed successfully

In [95]:
res = return_result( 'select * from emp2')
for i in res:
    print(i)

(1, 'Anthony Rodrigues', datetime.date(2006, 2, 8), 17, 'M', 'AI', 8.0, 300000.0, 'BOSTON')
(2, 'Mark Rodrigues', datetime.date(2004, 1, 26), 19, 'M', 'CS', 8.0, 268500.0, 'BOSTON')
(3, 'Leslie Rodrigues', datetime.date(2002, 8, 29), 21, 'M', 'CS', 7.0, 255000.0, 'BOSTON')
(4, 'Caleb Rodrigues', datetime.date(2013, 12, 28), 10, 'M', 'CS', 3.0, 195000.0, 'OHIO')
(5, 'Valencio Rodrigues', datetime.date(2001, 4, 12), 22, 'M', 'B', 5.0, 307500.0, 'BOSTON')
(7, 'Sharon Mascarenhas', datetime.date(2004, 8, 3), 19, 'F', 'CS', 4.0, 198000.0, 'VEGAS')
(8, 'Steven Mascarenhas', datetime.date(2008, 7, 26), 15, 'M', 'CS', 2.0, 171000.0, 'OHIO')
(9, 'Llyod Mascarenhas', datetime.date(2020, 11, 27), 3, 'M', 'CS', 2.0, 112500.0, 'WASHINGTON')
(10, 'Roshaun Rodrigues', datetime.date(2003, 8, 19), 20, 'M', 'IT', 3.0, 238500.0, 'VEGAS')
(11, 'Happy Alhuwalhia', datetime.date(2006, 8, 2), 17, 'M', 'IT', 8.0, 120000.0, 'BOSTON')
(12, 'Kaju Singh', datetime.date(2006, 8, 2), 17, 'M', 'IT', 8.0, 120000.0, 'BOSTON')

### User defined functions
---->1)<b>Scalar functions</b>: These types of functions return a single value, i.e float, int, varchar, datetime, etc.<br>
---->2)<b>Table-Valued functions</b>: These functions return multiple values as well as strings/ varchar .<br>

### scalar functions

In [96]:
#in any other ide we dont need to use delimiter but when working in mysql workbench we have to use it
# execute_query(connection, 'drop function calculate_revenue')
q1 ='''
CREATE FUNCTION calculate_revenue(quantity INT, unit_price DECIMAL(10,2)) RETURNS DECIMAL(10,2)
deterministic
BEGIN
    DECLARE total_price DECIMAL(10,2);
    SET total_price = quantity * unit_price;
    RETURN total_price;
END ;
'''

execute_query( q1)
return_result(' select calculate_revenue(20, 15.50);')

Error: 1304 (42000): FUNCTION calculate_revenue already exists

[(Decimal('310.00'),)]

In [97]:
# execute_query(connection, 'drop function calculate_age')
q2 = '''
CREATE FUNCTION calculate_age(yob YEAR)
RETURNS INT
Deterministic
BEGIN
    DECLARE age INT;
    SET age = YEAR(CURDATE()) - yob;
    RETURN age;
END ; '''
    
execute_query( q2)
return_result( ' select calculate_age(1993);')

Error: 1304 (42000): FUNCTION calculate_age already exists

[(30,)]

In [98]:
execute_query( 'drop function int_to_string')
q3 = '''CREATE FUNCTION int_to_string(num INT) RETURNS VARCHAR(255)
DETERMINISTIC
BEGIN
    DECLARE str VARCHAR(255);
    SET str = CAST(num AS CHAR);
    RETURN str;
END;'''

execute_query( q3)          
return_result( 'select int_to_string(45);')

Query executed successfully
Query executed successfully

[('45',)]

### Table-valued function

In [99]:
execute_query( 'drop function say_age')
q_1 = '''
CREATE FUNCTION say_age(yob YEAR)
RETURNS varchar(255)
Deterministic
BEGIN
    DECLARE age INT ;
    declare str_age varchar(255);
    declare str_yob varchar(255);
    SET age = YEAR(CURDATE()) - yob;
    set STR_AGE = CAST(age AS CHAR);
    set str_yob = cast(yob as char);
    RETURN concat('The birth year is ', yob, ' and the present year is ', year(curdate()),' so the age is ', age);
END ; '''
execute_query( q_1)
return_result( 'select say_age(2000);')

Query executed successfully
Query executed successfully

[('The birth year is 2000 and the present year is 2023 so the age is 23',)]

## Temporary tables

In [100]:
q1 = '''CREATE temporary TABLE temp_table (
  id INT,
  first_name VARCHAR(50),
  last_name VARCHAR(50),
  email VARCHAR(100),
  age INT
);'''
execute_query(q1)

q2 = '''INSERT INTO temp_table (id, first_name, last_name, email, age) VALUES
  (1, 'John', 'Doe', 'johndoe@hotmail.com', 30),
  (2, 'Jane', 'Smith', 'janesmith@yahoo.com', 25),
  (3, 'Bob', 'Johnson', 'bobjohnson@hotmail.com', 40),
  (4, 'Emily', 'Davis', 'emilydavis@gamail.com', 22),
  (5, 'David', 'Lee', 'davidlee@yahoo.com', 35),
  (6, 'Alice', 'Brown', 'alicebrown@gmail.com', 28),
  (7, 'Mark', 'Taylor', 'marktaylor@hotmail.com', 33),
  (8, 'Sarah', 'Clark', 'sarahclark@yahoo.com', 29),
  (9, 'Tom', 'Anderson', 'tomanderson@yahoo.com', 45),
  (10, 'Olivia', 'Wilson', 'oliviawilson@hotmail.com', 27);'''

execute_query(q2)

Query executed successfully
Error: 1146 (42S02): Table 'mysql_python.temp_table' doesn't exist

### Case statements

In [101]:
q1 = '''select *, case when Experience <= 4 then 'Junior'
when Experience > 4 and Experience <= 6 then 'Intermediate'
else 'Senior' end as Position from employee_details'''

res = return_result(q1)
for i in res:
    print(i)

(1, 'Anthony Rodrigues', datetime.date(2006, 2, 8), 17, 'M', 'AI', 8.0, 250000.0, 'BOSTON', 'Senior')
(2, 'Mark Rodrigues', datetime.date(2004, 1, 26), 19, 'M', 'CS', 8.0, 223750.0, 'BOSTON', 'Senior')
(3, 'Leslie Rodrigues', datetime.date(2004, 8, 29), 21, 'M', 'CS', 7.0, 212500.0, 'BOSTON', 'Senior')
(4, 'Caleb Rodrigues', datetime.date(2013, 12, 28), 10, 'M', 'CS', 3.0, 162500.0, 'OHIO', 'Junior')
(5, 'Valencio Rodrigues', datetime.date(2001, 4, 12), 22, 'M', 'B', 5.0, 256250.0, 'BOSTON', 'Intermediate')
(7, 'Sharon Mascarenhas', datetime.date(2004, 8, 3), 19, 'F', 'CS', 4.0, 165000.0, 'VEGAS', 'Junior')
(8, 'Steven Mascarenhas', datetime.date(2008, 7, 26), 15, 'M', 'CS', 2.0, 142500.0, 'OHIO', 'Junior')
(9, 'Llyod Mascarenhas', datetime.date(2020, 11, 27), 3, 'M', 'CS', 2.0, 93750.0, 'WASHINGTON', 'Junior')
(10, 'Roshaun Rodrigues', datetime.date(2003, 8, 19), 20, 'M', 'IT', 3.0, 198750.0, 'VEGAS', 'Junior')
(12, 'Salu Bhai', datetime.date(1999, 6, 25), 53, 'M', 'IT', 7.0, 71250.0, 'SEATTLE', 'Senior')
(13, 'P town', datetime.date(2009, 6, 10), 24, 'M', 'AI', 5.0, 212500.0, 'VEGAS', 'Intermediate')
(14, 'Rajesh', datetime.date(2013, 9, 18), 29, 'F', 'B', 8.0, 105000.0, 'SEATTLE', 'Senior')
(15, 'Bimles', datetime.date(2006, 9, 18), 59, 'F', 'FD', 6.0, 73327.8, 'WASHINGTON', 'Intermediate')

In [102]:
q1 = ''' select *, case when Applications_created like "web%" then "Software Engineer"
when Applications_created like "%Hardware%" then "Hardware Engineer"
else "Higher Roles" end as Role from employee_work '''

return_result(q1)
# [('emp2',), ('employee_details',), ('employee_work',), ('work_details',)]

[(1, 'web chatbot', 'recommendation_system', 'Software Engineer'),
 (2, 'web_backend', 'software updates', 'Software Engineer'),
 (3, 'web_design', 'updates', 'Software Engineer'),
 (4, 'web_design', 'additional tools', 'Software Engineer'),
 (5, 'Business analysis', 'Progress Ideas', 'Higher Roles'),
 (7, 'web_design', 'additional', 'Software Engineer'),
 (8, 'web_backend', 'software updates', 'Software Engineer'),
 (9, 'web_design', 'updates', 'Software Engineer'),
 (10, 'Hardware Malfunction', 'Debugging', 'Hardware Engineer'),
 (11, 'Hardware Malfunction', 'Debugging', 'Hardware Engineer'),
 (12, 'Hardware Malfunction', 'Debugging', 'Hardware Engineer'),
 (13, 'web chatbot', 'reccomendation_system', 'Software Engineer'),
 (14, 'Business analysis', 'Progress Ideas', 'Higher Roles')]

## if function

In [103]:
return_result("select EmployeeId, Name, City, if(City = 'BOSTON','400067','400068')as Pincode from employee_details where Employeeid < 10 order by Pincode asc ;")

[(1, 'Anthony Rodrigues', 'BOSTON', '400067'),
 (2, 'Mark Rodrigues', 'BOSTON', '400067'),
 (3, 'Leslie Rodrigues', 'BOSTON', '400067'),
 (5, 'Valencio Rodrigues', 'BOSTON', '400067'),
 (4, 'Caleb Rodrigues', 'OHIO', '400068'),
 (7, 'Sharon Mascarenhas', 'VEGAS', '400068'),
 (8, 'Steven Mascarenhas', 'OHIO', '400068'),
 (9, 'Llyod Mascarenhas', 'WASHINGTON', '400068')]

## Procedures

In [104]:
execute_query('drop table if exists employee')
q1 = '''CREATE TABLE employee (id INT NOT NULL,name VARCHAR(50),doj DATE,experience INT,salary DECIMAL(10,2),city VARCHAR(50),department VARCHAR(50),address VARCHAR(100),pincode VARCHAR(10),employee_type VARCHAR(50),PRIMARY KEY (id));'''
execute_query(q1)
q2 = ''' INSERT INTO employee (id, name, doj, experience, salary, city, department, address, pincode, employee_type)
VALUES(1, 'John Doe', '2010-05-15', 11, 50000, 'New York', 'Sales', '123 Main St', '10001', 'Full-time'),(2, 'Jane Smith', '2015-08-22', 6, 60000, 'Los Angeles', 'Marketing', '456 Elm St', '90001', 'Full-time'),(3, 'Bob Johnson', '2018-01-01', 3, 40000, 'Chicago', 'Finance', '789 Oak St', '60601', 'Part-time'),(4, 'Alice Lee', '2019-04-01', 2, 45000, 'San Francisco', 'HR', '321 Maple Ave', '94101', 'Full-time'),(5, 'David Kim', '2012-11-12', 9, 70000, 'Seattle', 'Engineering', '567 Pine St', '98101', 'Full-time'),(6, 'Samantha Brown', '2017-02-01', 4, 55000, 'Boston', 'Operations', '901 Chestnut St', '02108', 'Full-time'),(7, 'Erica Chen', '2020-08-01', 1, 35000, 'Houston', 'Marketing', '234 Elm St', '77001', 'Part-time'),(8, 'Chris Martin', '2011-06-15', 10, 80000, 'San Diego', 'Engineering', '789 Oak St', '92101', 'Full-time'),(9, 'Peter Wilson', '2016-09-01', 5, 60000, 'Denver', 'Finance', '345 Maple Ave', '80202', 'Full-time'),(10, 'Emily Davis', '2021-01-01', 0, 40000, 'Chicago', 'Operations', '678 Chestnut St', '60601', 'Part-time'),(11, 'Robert Garcia', '2010-03-15', 11, 75000, 'Dallas', 'Engineering', '345 Pine St', '75201', 'Full-time'),(12, 'Laura Hernandez', '2016-07-01', 5, 55000, 'Austin', 'HR', '890 Oak St', '78701', 'Full-time'),(13, 'Daniel Kim', '2018-10-01', 3, 45000, 'San Francisco', 'Operations', '456 Maple Ave', '94101', 'Part-time'),(14, 'Jessica Chen', '2014-12-01', 7, 65000, 'Seattle', 'Engineering', '789 Chestnut St', '98101', 'Full-time'),(15, 'Michael Lee', '2017-05-01', 4, 50000, 'Boston', 'Finance', '123 Elm St', '02108', 'Full-time'),(16, 'Maria Rodriguez', '2013-06-01', 8, 60000, 'Miami', 'Marketing', '567 Oak St', '33101', 'Full-time'),(17, 'Carlos Gonzalez', '2019-09-01', 2, 40000, 'Los Angeles', 'Operations', '901 Maple Ave', '90001', 'Part-time'),(18, 'Sophia Nguyen', '2015-03-01', 6, 55000, 'Seattle', 'Finance', '234 Pine St', '98101', 'Full-time'),(19, 'James Brown', '2018-02-01', 3, 45000, 'New York', 'HR', '678 Elm St', '10001', 'Part-time'),(20, 'Megan Wilson', '2020-06-01', 1, 35000, 'San Francisco', 'Engineering', '345 Oak St', '94101', 'Full-time');
'''
execute_query(q2)
res = return_result('select name, doj, experience, salary, city, department, address from employee limit 5')
for i in res:
    print(i)

Query executed successfully
Query executed successfully
Query executed successfully
('John Doe', datetime.date(2010, 5, 15), 11, Decimal('50000.00'), 'New York', 'Sales', '123 Main St')
('Jane Smith', datetime.date(2015, 8, 22), 6, Decimal('60000.00'), 'Los Angeles', 'Marketing', '456 Elm St')
('Bob Johnson', datetime.date(2018, 1, 1), 3, Decimal('40000.00'), 'Chicago', 'Finance', '789 Oak St')
('Alice Lee', datetime.date(2019, 4, 1), 2, Decimal('45000.00'), 'San Francisco', 'HR', '321 Maple Ave')
('David Kim', datetime.date(2012, 11, 12), 9, Decimal('70000.00'), 'Seattle', 'Engineering', '567 Pine St')

### with parameter

In [105]:
execute_query('drop procedure if exists P1')
q1 = '''create procedure P1(in emp_type varchar(30),in emp_city varchar(30))
begin 
select name, doj, experience, salary, city, department, address from employee where employee_type = emp_type and City != emp_city limit 3;
end ; '''

execute_query(q1)
res = return_result('call P1("Full-time", "Boston");')

if res is not None :
    for i in res :
        print(res)
else:
    print('Empty result')

Query executed successfully
Query executed successfully
Error: Use multi=True when executing multiple statements
Empty result

### without parameter

In [106]:
execute_query('drop procedure if exists P;')
q1 = ''' create procedure P() 
begin 
select * from employee_details
where year(D_O_J) between year(curdate())-10 and year(curdate());
end ; '''

execute_query(q1)
res = return_result('call P()')

if res is not None :
    for i in res :
        print(res)
else:
    print('Empty result')

Query executed successfully
Query executed successfully
Error: Use multi=True when executing multiple statements
Empty result

## Error handling using procedure

In [107]:
execute_query('drop procedure if exists t;')
q1 = '''create procedure t(in sal float)
begin
    declare exit handler for sqlexception
    begin
    get diagnostics condition 1 @sqlstate=RETURNED_SQLSTATE, @error_no = MYSQL_ERRNO, @text = MESSAGE_text;
    select concat('error num : ', @error_no,' Error : ', @text)as Error_Message;
    end;
    select l from employee where salary > sal;
end;'''

execute_query(q1)
return_result("call t(60000)")

Query executed successfully
Query executed successfully
Error: Use multi=True when executing multiple statements

## subquery

In [108]:
res = return_result("select * from employee where Salary=  (select max(Salary) from employee where Salary < (select max(Salary) from employee))")
for i in res:
    print(i)

(11, 'Robert Garcia', datetime.date(2010, 3, 15), 11, Decimal('75000.00'), 'Dallas', 'Engineering', '345 Pine St', '75201', 'Full-time')

## duplicate table
sntax : INSERT INTO table2 SELECT * FROM table1;

## triggers

### before insert

In [109]:
execute_query('drop table if exists records;')
execute_query('''create table records(id int not null primary key auto_increment,
                     Name varchar(255), Department varchar(255));''')

Query executed successfully
Query executed successfully

In [110]:
execute_query('drop trigger if exists t1')
execute_query('''create trigger t1
before insert on records
for each row
if new.Department not in ('CS','IT','AI') then set new.Department = 'Non-technical';
end if;''')

Query executed successfully
Query executed successfully

In [111]:
execute_query('''insert into records(Name, Department)
values('Rajesh','CS'),('Robert','IT'),('Rizwan','AI'),('Rahul','DS'),('Rohanpreet','ML'),('Ramacharan','IT'),
('Rakul','CS'),('Ram','AI'),('Roy','CS'),('Ravi','CS'),('Ravan','DS'),('Ronaldo','CS');''')

Query executed successfully

In [112]:
return_result('select * from records')

[(1, 'Rajesh', 'CS'),
 (2, 'Robert', 'IT'),
 (3, 'Rizwan', 'AI'),
 (4, 'Rahul', 'Non-technical'),
 (5, 'Rohanpreet', 'Non-technical'),
 (6, 'Ramacharan', 'IT'),
 (7, 'Rakul', 'CS'),
 (8, 'Ram', 'AI'),
 (9, 'Roy', 'CS'),
 (10, 'Ravi', 'CS'),
 (11, 'Ravan', 'Non-technical'),
 (12, 'Ronaldo', 'CS')]

### after insert

In [113]:
execute_query('drop table if exists entries')

execute_query('''create table entries(ID int primary key  auto_increment,
Name varchar(20) not null,
Department varchar(10),
Experience float);''')

execute_query('drop table if exists position_')

execute_query('''create table position_(Id int primary key auto_increment ,
Position varchar(30));''')

Query executed successfully
Query executed successfully
Query executed successfully
Query executed successfully

In [114]:
execute_query(' drop trigger if exists t2')
execute_query('''CREATE TRIGGER t2
AFTER INSERT ON entries
FOR EACH ROW 
IF new.Experience < 4 THEN
    INSERT INTO position_(Position)
    VALUES("Junior");
ELSEIF new.Experience BETWEEN 3 AND 6 THEN
    INSERT INTO position_(Position)
    VALUES("Intermediate");
ELSE
    INSERT INTO position_(Position)
    VALUES("Senior");
END IF;
''')

Query executed successfully
Query executed successfully

In [115]:
execute_query('''insert into entries(Name, Department, Experience)
values ('MikeHillyer','CS','4'),( 'JonStephens','DBM','7'),('Taniya','IT','5'),('Rahul','DS','3'),('Iqbal','AI','6'),
('John','DS','8'),('Gurpreet','IT','6'),('Paulo','CS','7'),('Rosario','DBM','5'),('Kylian','AI','4'),('Peter','IT','5'),
('Nurmagamedov','IT','2'),('Mcgregor','CS','9'),('Mark','CS',3)''')

Query executed successfully

In [116]:
return_result('select * from position_')

[(1, 'Intermediate'),
 (2, 'Senior'),
 (3, 'Intermediate'),
 (4, 'Junior'),
 (5, 'Intermediate'),
 (6, 'Senior'),
 (7, 'Intermediate'),
 (8, 'Senior'),
 (9, 'Intermediate'),
 (10, 'Intermediate'),
 (11, 'Intermediate'),
 (12, 'Junior'),
 (13, 'Senior'),
 (14, 'Junior')]